/**
 * Сообщения приложения
 *
 * @type {object}
 */
export const MESSAGES = {
    SUCCESS_CREATE: 'Запись успешно создана!',
    SUCCESS_UPDATE: 'Данные успешно обновлены!',
    FAILED_UPDATE: 'Не удалось обновить данные!',
    FIELDS_ERR: 'Некорректное значение одного или нескольких полей',
    SEARCH_TEXT_ERR: 'Введите ключевое слово',
    DELETE_CONFIRM: 'Вы уверены, что хотите удалить элемент?',
    ERROR_DELETE: 'Не удалось удалить запись!',
    ERROR_CREATE: 'Не удалось создать запись!',
    FORM_CHANGED_BEFORE_CLOSE: 'Возможно, на странице есть несохраненные данные. Вы уверены, что хотите закрыть окно?',
    UNDEFINED_ERR: 'На странице произошла неизвестная ошибка. Попробуйте ещё раз или обратитесь к системному администратору!',
};

/**
 * Сообщения настроек таблицы
 *
 * @type {object}
 */
export const MESSAGES_SETTINGS = {
    CANCEL: 'Вы уверены в том, что хотите удалить настройку?',
    WARNING: 'Нельзя скрывать все столбцы! Хотя бы один столбец должен быть видим!',
    DELETE: 'Удалить все настройки ...',
    SAVE: 'Сохранить и применить ...',
    EDIT_ERR: 'Ошибка редактирования записи:',
};
